//----------------------------------------------------------
#ifndef ISTORAGE_H
#define ISTORAGE_H
//----------------------------------------------------------

/**
 * @brief Абстрактный базовый класс для реализации кэша чатов
 */
class IStorage {

public:

    virtual ~IStorage() = default;

public:
};
//----------------------------------------------------------------------------------------------------------------------

#endif // ISTORAGE_H
//----------------------------------------------------------
