//----------------------------------------------------------
#include "Cache.h"
//----------------------------------------------------------

/*!
 * @brief Конструктор кэша
 * @param storage Указатель на объект, реализующий интерфейс хранилища
 */
Cache::Cache(std::unique_ptr<IStorage> storage)
    : m_storage(std::move(storage)) {
}
//----------------------------------------------------------------------------------------------------------------------

ChatPtr Cache::create(const Chat& chat) noexcept {
    return std::nullopt;
}
//----------------------------------------------------------------------------------------------------------------------

bool Cache::update(const Chat& chat) noexcept {
    return false;
}
//----------------------------------------------------------------------------------------------------------------------

ChatPtr Cache::find(int64_t chat_id) noexcept {
    return std::nullopt;
}
//----------------------------------------------------------------------------------------------------------------------

std::unordered_map<int64_t, Email> Cache::chats() noexcept {
    return {};
}
//----------------------------------------------------------------------------------------------------------------------
